# Лабораторная №0  
## Задача 1  
Задача a + b. В данной задаче требуется вычислить сумму двух заданных  
чисел. Вход: одна строка, которая содержит два целых числа a и b. Для этих  
чисел выполняются условия −109 ≤ a, b ≤ 109 . Выход: единственное целое  
число — результат сложения a + b.  
```
def func1(a, b):
    if -(10 ** 9) <= a <= (10 ** 9) and -(10 ** 9) <= b <= (10 ** 9):
        return a + b
    return None


print(func1(int(input()), int(input())))
```
Пропишем функцию, которая отвечает за вывод суммы a и b, предварительно проверив, подходят ли a и b под условие задачи.  
## Задача 2  
Задача a + b2 . В данной задаче требуется вычислить значение a + b^2. Вход:  
одна строка, которая содержит два целых числа a и b. Для этих чисел вы-  
полняются условия −109 ≤ a, b ≤ 109 . Выход: единственное целое число  
— результат сложения a + b^2.  
```
def func2(a, b):
    if -(10 ** 9) <= a <= (10 ** 9) and -(10 ** 9) <= b <= (10 ** 9):
        return a + (b ** 2)
    return None


print(func2(int(input()), int(input())))
```
Пропишем функцию, которая отвечает за вывод суммы a и b^2, предварительно проверив, подходят ли a и b под условие задачи.  
## Задача 3  
Выполните задачу a + b с использованием файлов.  
• Имя входного файла: input.txt  
• Имя выходного файла: output.txt  
• Формат входного файла. Входной файл состоит из одной строки, ко-  
торая содержит два целых числа a и b. Для этих чисел выполняются  
условия −109 ≤ a, b ≤ 109 .  
• Формат выходного файла. Выходной файл единственное целое число  
— результат сложения a + b.  
```
def func3():
    with open("input.txt", "r") as file_r:
        ab = [int(x) for x in file_r.read().split()]
        if -(10 ** 9) <= ab[0] <= (10 ** 9) and -(10 ** 9) <= ab[1] <= (10 ** 9):
            with open("output.txt", "w") as file_w:
                file_w.write(str(ab[0] + ab[1]))
```
Пропишем функцию, которая читает файл `input.txt`, затем проверяет, подходят ли a и b под условие задачи.  
Далее, откроем файл `output.txt` для ввода и запишем туда сумму a и b.  





